# exercise

In [1]:
import pandas as pd
import numpy as np

In [3]:
con1=pd.read_csv('concat_1.csv')
con2=pd.read_csv('concat_2.csv')
con3=pd.read_csv('concat_3.csv')
s_person=pd.read_csv('survey_person.csv')
s_site=pd.read_csv('survey_site.csv')
s_survey=pd.read_csv('survey_survey.csv')
s_visited=pd.read_csv('survey_visited.csv')

1. df1~df3 merge (위/아래)
2. how, axis 값을 변경해서 테스트
3. ignore_index 적용
4. merge / join 함수 버전으로 각각 수행
5. survey_ 파일에 대해 merge 연습
- survey_site, survey_visited 열 기준을 데이터 연결
6. 어느 회사의 전반기(1월~6월) 실적을 나타내는 데이터프레임과 후반기(7월 ~ 12월) 실적을 나타내는 데이터프레임을 임의로 만든 뒤 합친다. 실적 정보는 "매출", "비용", "이익" 으로 이루어진다. (이익 = 매출 - 비용).  
또한 1년간의 총 실적을 마지막 행으로 덧붙인다.

1월-6월                   7월-12  
월 매출 비용 이익         월 매출 비용 이익  
1  100  50   50  
2  
3  
..  
6  
  
=> 합치기  
1월~12월  
월 매출 비용 이익  
1  100   50   50  
2  
3  
..

##### df1~df3 merge (위/아래)  
##### how, axis 값을 변경해서 테스트
##### ignore_index 적용  
##### merge / join 함수 버전으로 각각 수행

1 - 4

In [4]:
con1, con2, con3

(    A   B   C   D
 0  a0  b0  c0  d0
 1  a1  b1  c1  d1
 2  a2  b2  c2  d2
 3  a3  b3  c3  d3,
     A   B   C   D
 0  a4  b4  c4  d4
 1  a5  b5  c5  d5
 2  a6  b6  c6  d6
 3  a7  b7  c7  d7,
      A    B    C    D
 0   a8   b8   c8   d8
 1   a9   b9   c9   d9
 2  a10  b10  c10  d10
 3  a11  b11  c11  d11)

pd.concat(objs, axis=0, join='outer', ignore_index=False, keys=None,
levels=None, names=None, verify_integrity=False, copy=True)

In [8]:
#1. 
pd.concat([con1, con2, con3], ignore_index=True)

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [ ]:
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
left_index=False, right_index=False, sort=True,
suffixes=('_x', '_y'), copy=True, indicator=False,
validate=None)

In [17]:
pd.merge(pd.merge(con1, con2, how='outer') , con3, how='outer')

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [83]:
con1.append(con2.append(con3, ignore_index=True), ignore_index=True)

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [84]:
c1=con1.T
c2=con2.T
c3=con3.T

In [98]:
c=c1.join(c2.join(c3, lsuffix='_left'), lsuffix='_left').T

In [105]:
c.reset_index(drop=True, inplace=True)
c

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

## survey_ 파일에 대해 merge 연습

In [108]:
s_site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [131]:
s_visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [124]:
s_site=s_site[s_site['site']==s_site['name']].drop(['name'], axis=1)

In [134]:
pd.merge(s_visited, s_site, on='site')

   ident   site       dated    lat    long
0    619   DR-1  1927-02-08 -49.85 -128.57
1    622   DR-1  1927-02-10 -49.85 -128.57
2    844   DR-1  1932-03-22 -49.85 -128.57
3    734   DR-3  1939-01-07 -47.15 -126.72
4    735   DR-3  1930-01-12 -47.15 -126.72
5    751   DR-3  1930-02-26 -47.15 -126.72
6    752   DR-3         NaN -47.15 -126.72
7    837  MSK-4  1932-01-14 -48.87 -123.40

#### 6.  
어느 회사의 전반기(1월~6월) 실적을 나타내는 데이터프레임과 후반기(7월 ~ 12월) 실적을 나타내는 데이터프레임을 임의로 만든 뒤 합친다.  
실적 정보는 "매출", "비용", "이익" 으로 이루어진다. (이익 = 매출 - 비용).  
또한 1년간의 총 실적을 마지막 행으로 덧붙인다.

1월-6월                   7월-12  
월 매출 비용 이익         월 매출 비용 이익  
1  100  50   50  
2  
3  
..  
6  
  
=> 합치기  
1월~12월  
월 매출 비용 이익  
1  100   50   50  
2  
3  
..

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [184]:
def profit_cal(sales, cost):
    profit = sales - cost
    return profit

In [193]:
# 전반기 월 매출/비용/이익 INPUT 및 저장
first_half={}
for month in range (1,7):
    values = []
    keys = month
    values.append(int(input(print("{}월 매출(sales): ".format(month)))))
    values.append(int(input(print("{}월 비용(cost): ".format(month)))))
    values.append(profit_cal(values[0],values[1]))
    first_half[keys] = values

1월 매출(sales):

None 200

1월 비용(cost):

None 30

2월 매출(sales):

None 200

2월 비용(cost):

None 30

3월 매출(sales):

None 200

3월 비용(cost):

None 30

4월 매출(sales):

None 200

4월 비용(cost):

None 30

5월 매출(sales):

None 200

5월 비용(cost):

None 30

6월 매출(sales):

None 200

6월 비용(cost):

None 30

In [206]:
first_df=pd.DataFrame(first_half, index=[['매출','비용','이익']]).T
first_df.index.name='월'
first_df

    매출  비용   이익
월
1  200  30  170
2  200  30  170
3  200  30  170
4  200  30  170
5  200  30  170
6  200  30  170

In [208]:
# 하반기 월 매출/비용/이익 INPUT 및 저장
second_half={}
for month in range (7,13):
    values = []
    keys = month
    values.append(int(input(print("{}월 매출(sales): ".format(month)))))
    values.append(int(input(print("{}월 비용(cost): ".format(month)))))
    values.append(profit_cal(values[0],values[1]))
    second_half[keys] = values

7월 매출(sales):

None 400

7월 비용(cost):

None 30

8월 매출(sales):

None 500

8월 비용(cost):

None 40

9월 매출(sales):

None 600

9월 비용(cost):

None 30

10월 매출(sales):

None 600

10월 비용(cost):

None 43

11월 매출(sales):

None 700

11월 비용(cost):

None 54

12월 매출(sales):

None 800

12월 비용(cost):

None 30

In [209]:
second_df=pd.DataFrame(second_half, index=[['매출','비용','이익']]).T
second_df.index.name='월'
second_df

     매출  비용   이익
월
7   400  30  370
8   500  40  460
9   600  30  570
10  600  43  557
11  700  54  646
12  800  30  770

In [214]:
anYear=pd.concat([first_df,second_df])
anYear

     매출  비용   이익
월
1   200  30  170
2   200  30  170
3   200  30  170
4   200  30  170
5   200  30  170
6   200  30  170
7   400  30  370
8   500  40  460
9   600  30  570
10  600  43  557
11  700  54  646
12  800  30  770

In [316]:
result=anYear.iloc[:,0:].sum(axis=0)
result

매출    4800
비용     407
이익    4393
dtype: int64

In [317]:
total=pd.DataFrame(result, columns=["합계"]).T
total

      매출   비용    이익
합계  4800  407  4393

In [318]:
annual_2020=pd.concat({'year': anYear,'total': total}, axis=0, join='outer', ignore_index=False, keys=None,
            levels=None, names=['annual','월'], verify_integrity=False, copy=True)
annual_2020

             매출   비용    이익
annual 월
year   1    200   30   170
       2    200   30   170
       3    200   30   170
       4    200   30   170
       5    200   30   170
       6    200   30   170
       7    400   30   370
       8    500   40   460
       9    600   30   570
       10   600   43   557
       11   700   54   646
       12   800   30   770
total  합계  4800  407  4393

# other options...

In [314]:
from numpy import random
np.random.seed(10)
# np.arange(1,7).reshape(2,6)
pd.DataFrame(np.random.random_integers(50,100, size=(2,6)), 
             columns=np.arange(7,13),
             index=['매출','비용'])

<ipython-input-314-8d2d483f541c>:4: DeprecationWarning: This function is deprecated. Please call randint(50, 100 + 1) instead
  pd.DataFrame(np.random.random_integers(50,100, size=(2,6)),

    7   8   9   10  11  12
매출  59  86  65  50  99  78
비용  75  79  98  79  99  58